/**
 * 题目：LX216 猴子吃桃
 * 来源：PTA LX216
 * 难度：中等
 * 标签：数学, 逆推
 *
 * == 原题 ==
 * LX216 猴子吃桃
 * 一只猴子在树上摘了若干个桃，当即吃了 x%，觉得不过瘾，又多吃了一个；
 * 第二天它吃了剩下桃子的 x% 加一个；
 * 第三天它又吃了剩下桃子的 x% 加一个，此时，只剩下一个桃子。
 * 请编程求解：猴子第一天从树上摘得多少个桃子？
 *
 * 输入格式:
 *   一个整数 x，0 < x < 100。题目确保每天的桃数为整数。
 *
 * 输出格式:
 *   输出第一天的桃子数量，题目确保为整数。
 *
 * 样例 #1:
 *   输入: 50
 *   输出: 22
 *
 * 样例 #2:
 *   输入: 99
 *   输出: 2010100
 *
 * 提示:
 *   1. 精度比较大的浮点数，默认采用科学计数法的形式进行输出，而整型不存在科学计数法的问题；
 *   2. 经过除法得到的浮点数可能存在表示精度问题，如果需要取整，可能存在数值错误，建议采用 round 函数；
 *   3. 因为题目确保每天的桃树为整数，可以放大 100 倍，把 x 作为整型参与运算，
 *      但是计算过程中一定要先乘后除，因为先进行除法可能会产生浮点数，进而导致精度丢失，结果错误。
 */
#include <bits/stdc++.h>
using namespace std;
int main(){
    double x,nums=1;
    int n;
    cin >> x;
    x=x/100;
    for (n=0;n<3;n++){
        nums=(nums+1)/(1-x);
    }
    printf("%.0lf\n",nums);
    return 0;
}