/**
 * 题目：列队报数一
 * 来源：PTA 32
 * 难度：中等
 * 标签：模拟, 数组
 *
 * == 原题 ==
 * 同学们正在练习列队，从第一个人开始按编号 1、2、…、n(n<1000) 报数，
 * 开始所有人都是面向前方，
 *   第一遍报数是 3 的倍数的同学执行一遍向后转命令，
 *   第二遍报数是 4 的倍数的同学执行一遍向后转命令，
 *   第三遍报数是 5 的倍数的同学执行一遍向后转命令。
 * 只考虑面向前方的同学向后转，不考虑已经向后转的同学再向前转的情况，
 * 输入人数 n，按顺序输出最终仍然面向前方的同学的编号。
 *
 * 输入格式:
 *   输入一个正整数 n。
 *
 * 输出格式:
 *   在一行中输出一个整数列，以空格间隔。
 *
 * 输入样例:
 *   10
 *
 * 输出样例:
 *   1 2 7
 */
#include <bits/stdc++.h>
using namespace std;
int main(){
    int nums[1000];
    int r,g;
    scanf("%d",&r);
    for (int i=1;i<=r;i++){
        nums[i]=1;
    }
    for (int n1=1;n1<=r;n1++){
        if (n1%3==0){
            nums[n1]=(-1)*nums[n1];
        }
    }
    for (int n2=1;n2<=r;n2++){
        if (n2%4==0){
            nums[n2]=(-1)*nums[n2];
        }
    }
    for (int n3=1;n3<=r;n3++){
        if (n3%5==0){
            nums[n3]=(-1)*nums[n3];
        }
    }
    for (int n4=1;n4<=r;n4++){
        g=0;
        if (nums[n4]==1){
            printf("%d",n4);
            for (int n5=n4+1;n5<=r;n5++){
                if (nums[n5]==1){
                    g++;
                    break;
                }
            }
        }
        if (g==1){
            printf(" ");
            g=0;
        }
    }
    return 0;
}